[
  {
    "category": "أذكار الجمعة",
    "zekr": "اللَّهُمَّ اجعل يومنا هذا يوماً مباركاً ووفقنا فيه لما تحب وترضى.",
    "reference": "سنة عامة",
    "description": "دعاء عند الاستيقاظ يوم الجمعة"
  },
  {
    "category": "أذكار الجمعة",
    "zekr": "اللَّهُمَّ إنِّي أعُوذُ بكَ مِن فِتْنَةِ النَّارِ وعَذابِ النَّارِ، وفِتْنَةِ القَبْرِ وعَذابِ القَبْرِ، وشَرِّ فِتْنَةِ الغِنَى وشَرِّ فِتْنَةِ الفَقْرِ، اللَّهُمَّ إنِّي أعُوذُ بكَ مِن شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ قَلْبِي بماءِ الثَّلجِ والبَرَدِ، ونَقِّ قَلْبِي مِنَ الخَطايا كما نَقَّيْتَ الثَّوْبَ الأبْيضَ مِنَ الدَّنَسِ، وباعِدْ بَيْنِي وبيْنَ خَطايايَ كما باعَدْتَ بيْنَ المَشْرِقِ والمَغْرِبِ، اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الكَسَلِ، والمَأْثَمِ والمَغْرَمِ.",
    "reference": "",
    "description": "دعاء شامل للوقاية من الفتن وطلب الطهارة والقرب من الله"
  },

  {
    "category": "أذكار الجمعة",
    "zekr": "اللَّهُمَّ اجعل لنا في هذا اليوم من الخير والبركة والرحمة نصيباً وافراً.",
    "reference": "سنة عامة",
    "description": "دعاء قصير يوم الجمعة"
  },
  {
    "category": "أذكار الجمعة",
    "zekr": "اللَّهُمَّ أنْتَ رَبِّي، لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ. إذا قالَ حِينَ يُمْسِي فَماتَ دَخَلَ الجَنَّةَ - أوْ: كانَ مِن أهْلِ الجَنَّةِ - وإذا قالَ حِينَ يُصْبِحُ فَماتَ مِن يَومِهِ مِثْلَهُ.",
    "reference": "↑ رواه البخاري، في صحيح البخاري، عن شداد بن أوس، الصفحة أو الرقم:6323، صحيح.",
    "description": "دعاء قصير يوم الجمعة للغفران والثواب"
  },
    {
    "category": "أذكار الجمعة",
    "zekr": "من قرأ سورة الكهف يوم الجمعة أضاء له من النور ما بين الجمعتين.",
    "reference": "النسائي 1897، الحاكم 1/366",
    "description": "قراءة سورة الكهف يوم الجمعة"
  },
  {
    "category": "صلاة على النبي",
    "zekr": "اللَّهُمَّ صلِّ على محمدٍ وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم في العالمين إنك حميد مجيد.",
    "reference": "حديث متفق عليه",
    "description": "الصلاة على النبي الكلاسيكية"
  },
  {
    "category": "صلاة على النبي",
    "zekr": "اللهم صل على محمد وعلى آله وأصحابه أجمعين، واغفر له ولهم، وارزقنا شفاعته يوم القيامة.",
    "reference": "سنن الترمذي",
    "description": "دعاء للصلاة على النبي مع طلب الشفاعة"
  },
  {
    "category": "صلاة على النبي",
    "zekr": "اللهم صل وسلم وبارك على سيدنا محمد عدد ما ذكره الذاكرون وغفل عن ذكره الغافلون.",
    "reference": "سنن ابن ماجه",
    "description": "الصلاة على النبي بعدد الذكر"
  }
]
