[
    {
    "Id": 25,
    "Version": "1.6.2",
    "Title": "تحسينات عامة للهواتف",
    "Date": "2025-09-10",
    "Details": "جميع الصور مصممة لتناسب الشاشات الكبيرة والصغيرة، النصوص والأزرار قابلة للضغط بسهولة، استخدام ScrollView لمحتوى قابل للتمرير، تحسين الألوان والتباين."
  },
    {
    "Id": 24,
    "Version": "1.6.2",
    "Title": "إصلاح Expander وMaui.Toolkit",
    "Date": "2025-09-10",
    "Details": "لإصلاح مشكلة Expander not found: إضافة CommunityToolkit.Maui عبر NuGet، تفعيل builder.UseMauiCommunityToolkit() في MauiProgram.cs، ثم يمكن استخدام <toolkit:Expander> في XAML."
  },
    {
    "Id": 23,
    "Version": "1.6.2",
    "Title": "تحسين صفحة اتجاه القبلة (QiblaPage)",
    "Date": "2025-09-10",
    "Details": "خلفية صورة ملء الشاشة compass_bg_full.png، مؤشر البوصلة: خلفية + سهم متحرك، دوران السهم بدقة عالية باستخدام Compass.ReadingChanged، عرض زاوية القبلة DirectionLabel، طلب إذن الموقع قبل الاستخدام، يدعم العمل بدون إنترنت بعد الحصول على الموقع."
  },
    {
    "Id": 22,
    "Version": "1.6.2",
    "Title": "تحسين صفحة الجمعة (FridayPage)",
    "Date": "2025-09-10",
    "Details": "تصميم صفحة الجمعة بلون أخضر وذهبي، عرض عنوان رئيسي وصورة مسجد، أزرار الأذكار: دعاء الجمعة وصلاة على النبي ﷺ، زر للوصول إلى صفحة سورة الكهف."
  },
    {
    "Id": 21,
    "Version": "1.6.2",
    "Title": "زر إظهار المزيد (Expander)",
    "Date": "2025-09-10",
    "Details": "إضافة Expander من Maui.Toolkit يحتوي على أزرار الجمعة واتجاه القبلة، قابل للتمرير أفقيًا، يتوسع فقط بمقدار المحتوى لتجنب مشاكل الشاشات الصغيرة، لكل زر أيقونة + اسم + TapGesture."
  },

    {
    "Id": 20,
    "Version": "1.6.2",
    "Title": "شريط الأزرار الرئيسي وتحسين الهاتف",
    "Date": "2025-09-10",
    "Details": "إعادة تصميم شريط الأزرار السفلي مع Grid مرن، أعمدة قابلة للتوسيع، أحجام أيقونات 42×42 وخط 13-14، تقليل Spacing وPadding، جميع الأزرار تحتوي على VerticalStackLayout + TapGestureRecognizer."
  },
    {
    "Id": 19,
    "Version": "1.6.1",
    "Title": "تحديث SurahPage",
    "Date": "2025-09-10",
    "Details": "تحميل سور من ملفات JSON محلية أو من الإنترنت، عرض السورة بالكامل مع الآيات المرقمة، تحسين تصميم النصوص مع تغيير الخط والمحاذاة وحفظ موقع Scroll."
  },
  {
    "Id": 18,
    "Version": "1.6.1",
    "Title": "تحديث AzkarListPage",
    "Date": "2025-09-10",
    "Details": "عرض قائمة الأذكار حسب الفئة باستخدام CarouselView، دعم أذكار متعددة مثل النوم، الجمعة، صلاة على النبي ﷺ، أذكار الصباح، إضافة أزرار التنقل بين الأذكار."
  },
  {
    "Id": 17,
    "Version": "1.6.0",
    "Title": "إضافة FridayPage",
    "Date": "2025-09-10",
    "Details": "صفحة الجمعة مع تصميم أخضر وذهبي، عرض عنوان رئيسي وصورة المسجد، زر الانتقال إلى سورة الكهف، وأزرار للأذكار المهمة والانتقال إلى AzkarListPage."
  },
  {
  "Id": 16,
  "Version": "1.5.1",
  "Title": "تحديث شامل مع أزرار سور جديدة وتحسين تصميم الآيات",
  "Date": "2025-09-10",
  "Details": "تمت إضافة الميزات التالية:\n1. إمكانية عرض أي سورة ديناميكيًا عبر الضغط على الأزرار (سورة الملك، سورة الفتح، سورة البينة).\n2. تحسين تصميم الصفحة للهواتف بحيث تكون الآيات متفرقة ومتناسقة كما في المصحف الرقمي.\n3. إضافة أزرار لأذكار الصباح وأذكار النوم مع ربط كل زر بالسورة المناسبة.\n4. حفظ موقع Scroll عند التمرير واسترجاعه عند العودة للصفحة.\n5. تحسين إعدادات الخط والألوان والمحاذاة لتكون مرنة حسب تفضيلات المستخدم.\n6. دعم تحميل ملفات السور من الإنترنت إذا لم تكن موجودة محليًا.\n7. عرض بسم الله الرحمن الرحيم بشكل مركزي فوق باقي الآيات.\n8. ترقيم الآيات بشكل واضح بجانب كل آية."
  },
  {
    "Id": 15,
    "Version": "1.5.1",
    "Title": "حفظ آخر موقع قراءة في صفحة السورة",
    "Date": "2025-09-10",
    "Details": "تمت إضافة ميزة حفظ موقع Scroll عند قراءة السورة، بحيث عند العودة للصفحة يتم الانتقال تلقائيًا لنفس المكان الذي توقفت عنده. كما تم ربط ScrollView باسم SurahScroll في XAML لضمان عمل الميزة."
  },
  {
  "Id": 14,
  "Version": "1.5.1",
  "Title": "تحسين واجهة صفحة السورة للأجهزة المحمولة",
  "Date": "2025-09-10",
  "Details": "تم تحسين تصميم صفحة السورة بحيث تظهر الكلمات بشكل مرتب وواضح، مع إبراز البسملة في الأعلى وعرض الآيات بطريقة تشبه المصحف. كما أصبح النص في الوسط بشكل متناسق وسهل القراءة على الهواتف."
  },
  {
  "Id": 13,
  "Version": "1.5.0",
  "Title": "تحسين صفحة الأذكار وإضافة زر دعاء النوم لسورة الملك",
  "Date": "2025-09-10",
  "Details": "تم إضافة زر دعاء النوم في صفحة الأذكار الذي يفتح صفحة جديدة تحتوي على سورة الملك من ملف JSON، مع حل مشاكل ترتيب العناصر وتصحيح محاذاة النصوص."
  },
  {
  "Id": 12,
  "Version": "1.4.2",
  "Title": "تم اصلاح مشاكل الاشعارات",
  "Date": "2025-09-10",
  "Details": "تم إصلاح مشاكل الإشعارات على الهاتف: إضافة صلاحية POST_NOTIFICATIONS في AndroidManifest.xml، طلب إذن الإشعارات في MainActivity.cs للأجهزة التي تعمل بنظام أندرويد 13 وما فوق، وتفعيل UseLocalNotification() في MauiProgram.cs. الآن تعمل الإشعارات على الكمبيوتر والهاتف بشكل صحيح."
  },
  {
  "Id": 11,
  "Version": "1.4.1",
  "Title": "إضافة تحسينات صفحة أسماء الله الحسنى",
  "Date": "2025-09-10",
  "Details": "تم إصلاح مشكلة عدم ظهور قاعدة البيانات بشكل صحيح، ومعالجة مشكلة ظهور الأسماء من ناحية اليسار بحيث أصبحت الآن تظهر من ناحية اليمين بشكل سليم. جميع المشاكل المرتبطة بالاتجاه والعرض تم حلها."
  },
  {
    "Id": 10,
    "Version": "1.4.0",
    "Title": "إضافة صفحة التحديثات",
    "Date": "2025-09-09",
    "Details": "تمت إضافة صفحة جديدة لعرض جميع التحديثات مع إشعار يظهر عند وجود تحديث جديد."
  },
  {
    "Id": 9,
    "Version": "1.3.1",
    "Title": "تحسينات في صفحة الإعدادات",
    "Date": "2025-09-09",
    "Details": "تم تحسين الأزرار الموجودة في صفحة الإعدادات بحيث يمكن التمرير باستخدام اللمس بالإصبع ولم تعد معطلة."
  },
  {
    "Id": 8,
    "Version": "1.3.0 - 1.3.6",
    "Title": "إضافة صفحة أسماء الله الحسنى",
    "Date": "2025-09-07",
    "Details": "إضافة صفحة تعرض جميع أسماء الله الحسنى مع الشرح وإمكانية الحفظ على آخر مكان توقفت عنده."
  },
  {
    "Id": 7,
    "Version": "1.2.0 - 1.2.1",
    "Title": "تحسين صفحة الأذكار",
    "Date": "2025-09-07",
    "Details": "إضافة أيقونات جميلة للأذكار وتنظيمها حسب الفئات (الصباح، المساء، الصلاة...)."
  },
  {
    "Id": 6,
    "Version": "1.1.0 - 1.1.5",
    "Title": "إضافة صفحة تحميل الموارد",
    "Date": "2025-09-06",
    "Details": "تمت إضافة صفحة تحميل تسمح بتنزيل قاعدة البيانات المحلية، أصوات القرآن، الأذكار وأسماء الله الحسنى للعمل بدون إنترنت."
  },
  {
    "Id": 5,
    "Version": "1.0.6",
    "Title": "تحسين شريط التنقل السفلي",
    "Date": "2025-09-06",
    "Details": "إعادة تصميم الأزرار السفلية مع تكبير الحجم وإضافة إيموجي جديدة للأقسام الرئيسية."
  },
  {
    "Id": 4,
    "Version": "1.0.5",
    "Title": "إضافة صفحة مواقيت الصلاة",
    "Date": "2025-09-05",
    "Details": "إضافة صفحة لمواقيت الصلاة مع دعم اختيار المنطقة وعرض الساعة الهجرية."
  },
  {
    "Id": 3,
    "Version": "1.0.4",
    "Title": "تحسين صفحة الإعدادات",
    "Date": "2025-09-04",
    "Details": "إضافة التحكم بحجم الخط، تغيير لون الخلفية، التبديل بين الوضع الليلي والنهاري، تغيير نوع الخط ولون النص والمسافات."
  },
  {
    "Id": 2,
    "Version": "1.0.2 - 1.0.3",
    "Title": "تحسين صفحة القرآن الكريم",
    "Date": "2025-09-03",
    "Details": "إضافة حفظ مكان القراءة، تشغيل الصوتيات عند النقر على الآيات، وإظهار التفسير عند النقر المزدوج."
  },
  {
    "Id": 1,
    "Version": "1.0.0",
    "Title": "الإصدار الأول للتطبيق",
    "Date": "2025-09-01",
    "Details": "إطلاق النسخة الأولى من التطبيق مع صفحة القرآن الكريم البسيطة والواجهة الرئيسية."
  }
]
